/*
*********************************************************************************************************
*                                             uC/USB-Host
*                                     The Embedded USB Host Stack
*
*                    Copyright 2004-2020 Silicon Laboratories Inc. www.silabs.com
*
*                                 SPDX-License-Identifier: APACHE-2.0
*
*               This software is subject to an open source license and is distributed by
*                Silicon Laboratories Inc. pursuant to the terms of the Apache License,
*                    Version 2.0 available at www.apache.org/licenses/LICENSE-2.0.
*
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                       HOST CONTROLLER DRIVER
*                              SYNOPSYS DESIGNWARE CORE USB 2.0 OTG (HS)
*
* File    : usbh_hcd_dwc_otg_hs.c
* Version : V3.42.00
*********************************************************************************************************
* Note(s) : (1) With an appropriate BSP, this host driver will support the OTG_FS host module on  the
*               STMicroelectronics STM32F7xx MCUs, this applies to the following:
*
*                         STM32F74xxx series.
*                         STM32F75xxx series.
*

#define  DWCOTGHS_MAX_NBR_CH                               8u   /* Maximum number of host channels                      */
#define  OTGHS_MAX_NBR_CH                                 16u   /* Maximum number of host channels for STM32F7          */
#define  DWCOTGHS_DFIFO_SIZE                            1024u   /* Number of entries                                    */
#define  DWCOTGHS_INVALID_CH                            0xFFu   /* Invalid channel number.                              */
#define  DWCOTGHS_DFLT_EP_ADDR                        0xFFFFu   /* Default endpoint address.                            */


#define  DWCOTGHS_MAX_RETRY                            10000u   /* Maximum number of retries                            */

                                                                /* See Note #1. FIFO depth is specified in 32-bit words */
#define  DWCOTGHS_RXFIFO_START_ADDR                        0u
#define  DWCOTGHS_RXFIFO_DEPTH                           512u   /* For all IN channels. See Note #2                     */
#define  DWCOTGHS_NONPER_CH_TXFIFO_DEPTH                 256u   /* For all Non-Periodic channels. See Note #3           */
#define  DWCOTGHS_NONPER_CH_TXFIFO_START_ADDR   (DWCOTGHS_RXFIFO_DEPTH)
#define  DWCOTGHS_PER_CH_TXFIFO_DEPTH                    256u   /* For all Periodic channels. See Note #4               */
#define  DWCOTGHS_PER_CH_TXFIFO_START_ADDR      (DWCOTGHS_NONPER_CH_TXFIFO_DEPTH +     \
                                                 DWCOTGHS_NONPER_CH_TXFIFO_START_ADDR)

#define  FRAME_MAX_VALUE                                   8u

                                                                /* If necessary, re-define these values in 'usbh_cfg.h' */
#ifndef  DWCOTGHS_URB_PROC_TASK_STK_SIZE
#define  DWCOTGHS_URB_PROC_TASK_STK_SIZE                 256u
#endif

#ifndef  DWCOTGHS_URB_PROC_TASK_PRIO
#define  DWCOTGHS_URB_PROC_TASK_PRIO                      15u
#endif

#ifndef  DWCOTGHS_URB_PROC_Q_MAX
#define  DWCOTGHS_URB_PROC_Q_MAX                          10u
#endif

#if     (OS_VERSION < 30000u)
#if     (OS_TMR_EN < 1)
#error  "OS_TMR_EN must be equal to 1"
#endif

#if     (OS_TICKS_PER_SEC != 1000u)
#error  "OS_TICKS_PER_SEC must be equal to 1000"
#endif

#if     (OS_TMR_CFG_TICKS_PER_SEC != OS_TICKS_PER_SEC)
#error  "OS_TMR_CFG_TICKS_PER_SEC must be equal to OS_TICKS_PER_SEC"
#endif

#else
#if     (OS_CFG_TMR_EN != DEF_ENABLED)
#error  "OS_CFG_TMR_EN must be equal to DEF_ENABLED"
#endif

#if     (OS_CFG_TICK_RATE_HZ != 1000u)
#error  "OS_CFG_TICK_RATE_HZ must be equal to 1000"
#endif

#if     (OS_CFG_TMR_TASK_RATE_HZ != OS_CFG_TICK_RATE_HZ)
#error  "OS_CFG_TMR_TASK_RATE_HZ must be equal to OS_TICKS_PER_SEC"
#endif
#endif


/*
*********************************************************************************************************
*                                           LOCAL DATA TYPES
*********************************************************************************************************
*/

typedef  struct  usbh_dwcotghs_host_ch_reg {                    /* ------------- HOST CHANNEL-X DATA TYPE ------------- */
    CPU_REG32                  HCCHARx;                         /* Host channel-x characteristics                       */
    CPU_REG32                  HCSPLTx;                         /* Host channel-x split control                         */
    CPU_REG32                  HCINTx;                          /* Host channel-x interrupt                             */
    CPU_REG32                  HCINTMSKx;                       /* Host channel-x interrupt mask                        */
    CPU_REG32                  HCTSIZx;                         /* Host channel-x transfer size                         */
    CPU_REG32                  HCDMAx;                          /* Host channel-x DMA address                           */
    CPU_REG32                  RSVD1[2u];
} USBH_DWCOTGHS_HOST_CH_REG;


typedef  struct  usbh_dwcotghs_dfifo_reg {                      /* ---------- DATA FIFO ACCESS DATA TYPE -------------- */
    CPU_REG32                  DATA[DWCOTGHS_DFIFO_SIZE];       /* 4K bytes per endpoint                                */
} USBH_DWCOTGHS_DFIFO_REG;


typedef  struct  usbh_dwcotghs_reg {
                                                                /* ----- CORE GLOBAL CONTROL AND STATUS REGISTERS ----- */
    CPU_REG32                  GOTGCTL;                         /* 0x0000 Core control and status                       */
    CPU_REG32                  GOTGINT;                         /* 0x0004 Core interrupt                                */
    CPU_REG32                  GAHBCFG;                         /* 0x0008 Core AHB configuration                        */
    CPU_REG32                  GUSBCFG;                         /* 0x000C Core USB configuration                        */
    CPU_REG32                  GRSTCTL;                         /* 0x0010 Core reset                                    */
    CPU_REG32                  GINTSTS;                         /* 0x0014 Core interrupt                                */
    CPU_REG32                  GINTMSK;                         /* 0x0018 Core interrupt mask                           */
    CPU_REG32                  GRXSTSR;                         /* 0x001C Core receive status debug read                */
    CPU_REG32                  GRXSTSP;                         /* 0x0020 Core status read and pop                      */
    CPU_REG32                  GRXFSIZ;                         /* 0x0024 Core receive FIFO size                        */
    CPU_REG32                  HNPTXFSIZ;                       /* 0x0028 Host non-periodic transmit FIFO size          */
    CPU_REG32                  HNPTXSTS;                        /* 0x002C Core Non Periodic Tx FIFO/Queue status        */
    CPU_REG32                  RSVD0[2u];
    CPU_REG32                  GCCFG;                           /* 0x0038 General core configuration                    */
    CPU_REG32                  CID;                             /* 0x003C Core ID register                              */
    CPU_REG32                  RSVD1[48u];
    CPU_REG32                  HPTXFSIZ;                        /* 0x0100 Core Host Periodic Tx FIFO size               */
    CPU_REG32                  RSVD2[191u];
                                                                /* ------ HOST MODE CONTROL AND STATUS REGISTERS ------ */
    CPU_REG32                  HCFG;                            /* 0x0400 Host configuration                            */
    CPU_REG32                  HFIR;                            /* 0x0404 Host frame interval                           */
    CPU_REG32                  HFNUM;                           /* 0x0408 Host frame number/frame time remaining        */
    CPU_REG32                  RSVD3;
    CPU_REG32                  HPTXSTS;                         /* 0x0410 Host periodic transmit FIFO/queue status      */
    CPU_REG32                  HAINT;                           /* 0x0414 Host all channels interrupt                   */
    CPU_REG32                  HAINTMSK;                        /* 0x0418 Host all channels interrupt mask              */
    CPU_REG32                  RSVD4[9u];
    CPU_REG32                  HPRT;                            /* 0x0440 Host port control and status                  */
    CPU_REG32                  RSVD5[47u];
    USBH_DWCOTGHS_HOST_CH_REG  HCH[OTGHS_MAX_NBR_CH];           /* 0x0500 Host Channel-x regiters                       */
    CPU_REG32                  RSVD6[448u];
                                                                /* -- POWER & CLOCK GATING CONTROL & STATUS REGISTER -- */
    CPU_REG32                  PCGCR;                           /* 0x0E00 Power anc clock gating control                */
    CPU_REG32                  RSVD7[127u];
                                                                /* --- DATA FIFO (DFIFO) HOST-CH X ACCESS REGISTERS --- */
    USBH_DWCOTGHS_DFIFO_REG    DFIFO[OTGHS_MAX_NBR_CH];         /* 0x1000 Data FIFO host channel-x access registers     */
} USBH_DWCOTGHS_REG;


/*
*********************************************************************************************************
*                                          DRIVER DATA TYPE
*********************************************************************************************************
*/

typedef  struct  usbh_dwcotghs_ch_info {
    CPU_INT16U             EP_Addr;                             /* Device addr | EP DIR | EP NBR.                       */
    CPU_INT08U             EP_TxErrCnt;
                                                                /* To ensure the URB EP xfer size is not corrupted ...  */
    CPU_INT32U             AppBufLen;                           /* ... for multi-transaction transfer                   */
    USBH_URB              *URB_Ptr;
