/*
*********************************************************************************************************
*                                             uC/USB-Host
*                                     The Embedded USB Host Stack
*
*                    Copyright 2004-2020 Silicon Laboratories Inc. www.silabs.com
*
*                                 SPDX-License-Identifier: APACHE-2.0
*
*               This software is subject to an open source license and is distributed by
*                Silicon Laboratories Inc. pursuant to the terms of the Apache License,
*                    Version 2.0 available at www.apache.org/licenses/LICENSE-2.0.
*
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                  STM32FX_FS HOST CONTROLLER DRIVER
*
* Filename : usbh_hcd_stm32fx_fs.c
* Version  : V3.42.00
*********************************************************************************************************
* Note(s)  : (1) With an appropriate BSP, this host driver will support the OTG_FS host module on
*                the STMicroelectronics STM32F10xxx, STM32F2xx, STM32F4xx, and STM32F7xx MCUs, this
*                applies to the following:
*
*                    STM32F105xx series.
*                    STM32F107xx series.
*                    STM32F205xx series.

*                   (one space for status information written to the FIFO along with each received packet)
*               (b) data IN channel       = (Largest Packet Size / 4) + 1 spaces
*                   (MINIMUM to receive packets)
*               (c) OR data IN channel    = at least 2*(Largest Packet Size / 4) + 1 spaces
*                   (if high-bandwidth channel is enabled or multiple isochronous channels)
*               (d) transfer complete status information = 1 space per OUT EP
*                   (one space for transfer complete status information also pushed to the FIFO
*                   with each channel's last packet)
*
*           (3) Non-periodic Transmit FIFO RAM allocation:
*               - MIN RAM space = largest max packet size among all supported non-periodic OUT channels.
*               - RECOMMENDED   = two largest packet sizes
*
*           (4) Periodic Transmit FIFO RAM allocation:
*               - MIN RAM space = largest max packet size among all supported periodic OUT channels.
*               - if one high bandwidth isochronous OUT channel, 2 * max packet size of that channel
**************************************************************************************************************
*/

#define  DRV_STM32FX_FS                                    0u
#define  DRV_STM32FX_OTG_FS                                1u
#define  DRV_EFM32_OTG_FS                                  2u

#define  STM32FX_FS_MAX_NBR_CH                             8u   /* Maximum number of host channels                      */
#define  STM32FX_OTG_FS_MAX_NBR_CH                        12u   /* Maximum number of host channels                      */
#define  STM32FX_DFIFO_SIZE                             1024u   /* Number of entries                                    */


#define  STM32FX_MAX_RETRY                             10000u   /* Maximum number of retries                            */

                                                                /* See Note #1. FIFO depth is specified in 32-bit words */
#define  STM32FX_FS_RXFIFO_START_ADDR                      0u
#define  STM32FX_FS_RXFIFO_DEPTH                          64u   /* For all IN channels. See Note #2                     */
#define  STM32FX_FS_NONPER_CH_TXFIFO_DEPTH               128u   /* For all Non-Periodic channels. See Note #3           */
#define  STM32FX_FS_NONPER_CH_TXFIFO_START_ADDR   (STM32FX_FS_RXFIFO_DEPTH)
#define  STM32FX_FS_PER_CH_TXFIFO_DEPTH                  128u   /* For all Periodic channels. See Note #4               */
#define  STM32FX_FS_PER_CH_TXFIFO_START_ADDR      (STM32FX_FS_NONPER_CH_TXFIFO_DEPTH +     \
                                                   STM32FX_FS_NONPER_CH_TXFIFO_START_ADDR)

/*
*********************************************************************************************************
*                                           LOCAL DATA TYPES
*********************************************************************************************************
*/

typedef  struct  usbh_stm32fx_host_ch_reg {                     /* ------------- HOST CHANNEL-X DATA TYPE ------------- */
    CPU_REG32                 HCCHARx;                          /* Host channel-x characteristics                       */
    CPU_REG32                 HCSPLTx;                          /* Host channel-x split control                         */
    CPU_REG32                 HCINTx;                           /* Host channel-x interrupt                             */
    CPU_REG32                 HCINTMSKx;                        /* Host channel-x interrupt mask                        */
    CPU_REG32                 HCTSIZx;                          /* Host channel-x transfer size                         */
    CPU_REG32                 HCDMAx;                           /* Host channel-x DMA address                           */
    CPU_REG32                 RSVD1[2u];
} USBH_STM32FX_HOST_CH_REG;


typedef  struct  usbh_stm32fx_dfifo_reg {                       /* ---------- DATA FIFO ACCESS DATA TYPE -------------- */
    CPU_REG32                 DATA[STM32FX_DFIFO_SIZE];         /* 4K bytes per endpoint                                */
} USBH_STM32FX_DFIFO_REG;


typedef  struct  usbh_stm32fx_reg {
                                                                /* ----- CORE GLOBAL CONTROL AND STATUS REGISTERS ----- */
    CPU_REG32                 GOTGCTL;                          /* 0x0000 Core control and status                       */
    CPU_REG32                 GOTGINT;                          /* 0x0004 Core interrupt                                */
    CPU_REG32                 GAHBCFG;                          /* 0x0008 Core AHB configuration                        */
    CPU_REG32                 GUSBCFG;                          /* 0x000C Core USB configuration                        */
    CPU_REG32                 GRSTCTL;                          /* 0x0010 Core reset                                    */
    CPU_REG32                 GINTSTS;                          /* 0x0014 Core interrupt                                */
    CPU_REG32                 GINTMSK;                          /* 0x0018 Core interrupt mask                           */
    CPU_REG32                 GRXSTSR;                          /* 0x001C Core receive status debug read                */
    CPU_REG32                 GRXSTSP;                          /* 0x0020 Core status read and pop                      */
    CPU_REG32                 GRXFSIZ;                          /* 0x0024 Core receive FIFO size                        */
    CPU_REG32                 HNPTXFSIZ;                        /* 0x0028 Host non-periodic transmit FIFO size          */
    CPU_REG32                 HNPTXSTS;                         /* 0x002C Core Non Periodic Tx FIFO/Queue status        */
    CPU_REG32                 RSVD0[2u];
    CPU_REG32                 GCCFG;                            /* 0x0038 General core configuration                    */
    CPU_REG32                 CID;                              /* 0x003C Core ID register                              */
    CPU_REG32                 RSVD1[48u];
    CPU_REG32                 HPTXFSIZ;                         /* 0x0100 Core Host Periodic Tx FIFO size               */
    CPU_REG32                 RSVD2[191u];
                                                                /* ------ HOST MODE CONTROL AND STATUS REGISTERS ------ */
    CPU_REG32                 HCFG;                             /* 0x0400 Host configuration                            */
    CPU_REG32                 HFIR;                             /* 0x0404 Host frame interval                           */
    CPU_REG32                 HFNUM;                            /* 0x0408 Host frame number/frame time remaining        */
    CPU_REG32                 RSVD3;
    CPU_REG32                 HPTXSTS;                          /* 0x0410 Host periodic transmit FIFO/queue status      */
    CPU_REG32                 HAINT;                            /* 0x0414 Host all channels interrupt                   */
    CPU_REG32                 HAINTMSK;                         /* 0x0418 Host all channels interrupt mask              */
    CPU_REG32                 RSVD4[9u];
    CPU_REG32                 HPRT;                             /* 0x0440 Host port control and status                  */
    CPU_REG32                 RSVD5[47u];
    USBH_STM32FX_HOST_CH_REG  HCH[16u];                         /* 0x0500 Host Channel-x regiters                       */
    CPU_REG32                 RSVD6[448u];
                                                                /* -- POWER & CLOCK GATING CONTROL & STATUS REGISTER -- */
    CPU_REG32                 PCGCR;                            /* 0x0E00 Power anc clock gating control                */
    CPU_REG32                 RSVD7[127u];
                                                                /* --- DATA FIFO (DFIFO) HOST-CH X ACCESS REGISTERS --- */
    USBH_STM32FX_DFIFO_REG    DFIFO[STM32FX_OTG_FS_MAX_NBR_CH]; /* 0x1000 Data FIFO host channel-x access registers     */
} USBH_STM32FX_REG;


/*
*********************************************************************************************************
*                                             LOCAL TABLES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                          DRIVER DATA TYPE
*********************************************************************************************************
*/

typedef  struct  usbh_stm32fx_ch_info {
    CPU_INT16U            EP_Addr;                              /* Device addr | EP DIR | EP NBR.                       */
    CPU_INT32U            EP_PktCnt;                            /* For OUT EP packet count.                             */
